# frozen_string_literal: true

require "spec_helper"
require "pry"

RSpec.describe Payassist::Bank do
  before do
    Payassist.configure do |config|
      config.base_url = "https://api.payassist.io/p2p"
      config.client_id = "lj8NGi7xt5UgJx1J"
      config.client_secret = "EbsiNBLw5A8Dq0ipveafiGGgCZb9UY"
    end
  end

  let(:bank) { described_class.new }

  describe "#all" do
    subject(:result) { bank.all }

    let(:banks_data) do
      {
        "errors" => nil,
        "header" => { "androidVersion" => 1, "iosVersion" => "1.0", "lang" => "EN", "traceId" => "29619102a405f69b",
                      "txName" => "", "version" => "0.1" },
        "responseData" => [{ "id" => "100000000111", "name" => "Сбербанк" },
                           { "id" => "110000000005", "name" => "Банк ВТБ" },
                           { "id" => "100000000008", "name" => "АЛЬФА-БАНК" },
                           { "id" => "100000000007", "name" => "Райффайзенбанк" },
                           { "id" => "100000000015", "name" => "Банк ОТКРЫТИЕ" },
                           { "id" => "100000000001", "name" => "Газпромбанк" },
                           { "id" => "100000000010", "name" => "Промсвязьбанк" },
                           { "id" => "100000000013", "name" => "Совкомбанк" },
                           { "id" => "100000000012", "name" => "РОСБАНК" },
                           { "id" => "100000000020", "name" => "Россельхозбанк" },
                           { "id" => "100000000025", "name" => "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК" },
                           { "id" => "100000000030", "name" => "ЮниКредит Банк" },
                           { "id" => "100000000003", "name" => "Банк Синара" },
                           { "id" => "100000000043", "name" => "Газэнергобанк" },
                           { "id" => "100000000028", "name" => "АКБ АВАНГАРД" },
                           { "id" => "100000000086", "name" => "ПНКО ЭЛПЛАТ" },
                           { "id" => "100000000011", "name" => "РНКБ Банк" },
                           { "id" => "100000000044", "name" => "Экспобанк" },
                           { "id" => "100000000049", "name" => "Банк ВБРР" },
                           { "id" => "100000000095", "name" => "АБ РОССИЯ" },
                           { "id" => "100000000900", "name" => "ДБО Фактура" },
                           { "id" => "100000000056", "name" => "КБ Хлынов" },
                           { "id" => "100000000053", "name" => "Бланк банк" },
                           { "id" => "100000000121", "name" => "КБ Солидарность" },
                           { "id" => "100000000082", "name" => "Банк ДОМ.РФ" },
                           { "id" => "100000000127", "name" => "Хакасский муниципальный банк" },
                           { "id" => "100000000017", "name" => "МТС-Банк" },
                           { "id" => "100000000087", "name" => "Банк ПСКБ" },
                           { "id" => "100000000052", "name" => "Банк Левобережный" },
                           { "id" => "100000000006", "name" => "АК БАРС БАНК" },
                           { "id" => "100000000098", "name" => "КБ РостФинанс" },
                           { "id" => "100000000092", "name" => "БыстроБанк" },
                           { "id" => "100000000229", "name" => "МС Банк Рус" },
                           { "id" => "100000000027", "name" => "Кредит Европа Банк (Россия)" },
                           { "id" => "100000000080", "name" => "АКБ Алмазэргиэнбанк" },
                           { "id" => "100000000122", "name" => "ИК Банк" },
                           { "id" => "100000000124", "name" => "БАНК ОРЕНБУРГ" },
                           { "id" => "100000000118", "name" => "КБ АГРОПРОМКРЕДИТ" },
                           { "id" => "100000000159", "name" => "АКБ Энергобанк" },
                           { "id" => "100000000146", "name" => "КОШЕЛЕВ-БАНК" },
                           { "id" => "100000000069", "name" => "СДМ-Банк" },
                           { "id" => "100000000140", "name" => "МБ Банк" },
                           { "id" => "100000000047", "name" => "АКБ Абсолют Банк" },
                           { "id" => "100000000099", "name" => "КБ Модульбанк" },
                           { "id" => "100000000135", "name" => "Банк Акцепт" },
                           { "id" => "100000000139", "name" => "КБ ЭНЕРГОТРАНСБАНК" },
                           { "id" => "100000000166", "name" => "СИБСОЦБАНК" },
                           { "id" => "100000000172", "name" => "Банк Развитие-Столица" },
                           { "id" => "100000000187", "name" => "Банк РЕСО Кредит" },
                           { "id" => "100000000022", "name" => "НКО ЮМани" },
                           { "id" => "100000000029", "name" => "Банк Санкт-Петербург" },
                           { "id" => "100000000050", "name" => "КБ Кубань Кредит" },
                           { "id" => "100000000065", "name" => "Точка ФК Открытие" },
                           { "id" => "100000000177", "name" => "АКБ НОВИКОМБАНК" },
                           { "id" => "100000000084", "name" => "РосДорБанк" },
                           { "id" => "100000000088", "name" => "СКБ Приморья Примсоцбанк" },
                           { "id" => "100000000126", "name" => "Банк Саратов" },
                           { "id" => "100000000173", "name" => "Таврический Банк" },
                           { "id" => "100000000152", "name" => "Тольяттихимбанк" },
                           { "id" => "100000000201", "name" => "Банк Кремлевский" },
                           { "id" => "100000000034", "name" => "ТКБ БАНК" },
                           { "id" => "100000000094", "name" => "ЧЕЛЯБИНВЕСТБАНК" },
                           { "id" => "100000000235", "name" => "АКБ Держава" },
                           { "id" => "100000000134", "name" => "НБД-Банк" },
                           { "id" => "100000000091", "name" => "БАНК СНГБ" },
                           { "id" => "100000000258", "name" => "АИКБ Енисейский объединенный банк" },
                           { "id" => "100000000153", "name" => "Банк Венец" },
                           { "id" => "100000000016", "name" => "Почта Банк" },
                           { "id" => "100000000014", "name" => "Банк Русский Стандарт" },
                           { "id" => "100000000083", "name" => "Дальневосточный банк" },
                           { "id" => "100000000170", "name" => "Банк Интеза" },
                           { "id" => "100000000037", "name" => "ГЕНБАНК" },
                           { "id" => "100000000215", "name" => "ВУЗ-банк" },
                           { "id" => "100000000142", "name" => "УРАЛПРОМБАНК" },
                           { "id" => "100000000243", "name" => "Банк Национальный стандарт" },
                           { "id" => "100000000090", "name" => "Банк Екатеринбург" },
                           { "id" => "100000000171", "name" => "МОРСКОЙ БАНК" },
                           { "id" => "100000000064", "name" => "Кредит Урал Банк" },
                           { "id" => "100000000093", "name" => "Углеметбанк" },
                           { "id" => "100000000253", "name" => "Авто Финанс Банк" },
                           { "id" => "100000000193", "name" => "КБ СТРОЙЛЕСБАНК" },
                           { "id" => "100000000158", "name" => "Банк ИТУРУП" },
                           { "id" => "100000000174", "name" => "Первый Инвестиционный Банк" },
                           { "id" => "100000000183", "name" => "Газтрансбанк" },
                           { "id" => "100000000106", "name" => "ЧЕЛИНДБАНК" },
                           { "id" => "100000000115", "name" => "НИКО-БАНК" },
                           { "id" => "100000000062", "name" => "НОКССБАНК" },
                           { "id" => "100000000058", "name" => "ВЛАДБИЗНЕСБАНК" },
                           { "id" => "100000000195", "name" => "Кузнецкбизнесбанк" },
                           { "id" => "100000000130", "name" => "Автоградбанк" },
                           { "id" => "100000000206", "name" => "Томскпромстройбанк" },
                           { "id" => "100000000203", "name" => "АКБ МЕЖДУНАРОДНЫЙ ФИНАНСОВЫЙ КЛУБ" },
                           { "id" => "100000000081", "name" => "АКБ Форштадт" },
                           { "id" => "100000000230", "name" => "АКБ Солид" },
                           { "id" => "100000000211", "name" => "Банк АЛЕКСАНДРОВСКИЙ" },
                           { "id" => "100000000107", "name" => "АКИБАНК" },
                           { "id" => "100000000185", "name" => "Нацинвестпромбанк" },
                           { "id" => "100000000113", "name" => "АКБ Алеф-Банк" },
                           { "id" => "100000000248", "name" => "КБ ВНЕШФИНБАНК" },
                           { "id" => "100000000151", "name" => "КБ Урал ФД" },
                           { "id" => "100000000129", "name" => "КБ АРЕСБАНК" },
                           { "id" => "100000000208", "name" => "Северный Народный Банк" },
                           { "id" => "100000000182", "name" => "Банк Объединенный капитал" },
                           { "id" => "100000000189", "name" => "ТАТСОЦБАНК" },
                           { "id" => "100000000202", "name" => "Норвик Банк" },
                           { "id" => "100000000213", "name" => "Джей энд Ти Банк" },
                           { "id" => "100000000071", "name" => "НС Банк" },
                           { "id" => "100000000066", "name" => "Земский банк" },
                           { "id" => "100000000154", "name" => "Банк Аверс" },
                           { "id" => "100000000194", "name" => "КБ РУСНАРБАНК" },
                           { "id" => "100000000232", "name" => "РЕАЛИСТ БАНК" },
                           { "id" => "100000000105", "name" => "Эс-Би-Ай Банк" },
                           { "id" => "100000000136", "name" => "МЕТКОМБАНК" },
                           { "id" => "100000000191", "name" => "КБЭР Банк Казани" },
                           { "id" => "100000000197", "name" => "АКБ Трансстройбанк" },
                           { "id" => "100000000205", "name" => "Банк Заречье" },
                           { "id" => "100000000059", "name" => "КБ Центр-инвест" },
                           { "id" => "100000000070", "name" => "Датабанк" },
                           { "id" => "100000000112", "name" => "КБ Гарант-Инвест" },
                           { "id" => "100000000223", "name" => "СОЦИУМ-БАНК" },
                           { "id" => "100000000148", "name" => "КБ СИНКО-БАНК" },
                           { "id" => "100000000199", "name" => "ИШБАНК" },
                           { "id" => "100000000045", "name" => "Банк ЗЕНИТ" },
                           { "id" => "100000000217", "name" => "АКБ ФОРА-БАНК" },
                           { "id" => "100000000169", "name" => "МП Банк" },
                           { "id" => "100000000227", "name" => "Банк БКФ" },
                           { "id" => "100000000125", "name" => "ГОРБАНК" },
                           { "id" => "100000000176", "name" => "МОСКОМБАНК" },
                           { "id" => "100000000144", "name" => "Тимер Банк" },
                           { "id" => "100000000128", "name" => "КБ Ситибанк" },
                           { "id" => "100000000181", "name" => "Автоторгбанк" },
                           { "id" => "100000000026", "name" => "БАНК УРАЛСИБ" },
                           { "id" => "100000000078", "name" => "Ингосстрах Банк" },
                           { "id" => "100000000165", "name" => "Русьуниверсалбанк" },
                           { "id" => "100000000031", "name" => "КБ УБРиР" },
                           { "id" => "100000000226", "name" => "АКБ Приморье" },
                           { "id" => "100000000236", "name" => "Банк ИПБ" },
                           { "id" => "100000000103", "name" => "КБ Пойдём!" },
                           { "id" => "100000000175", "name" => "АКБ ТЕНДЕР-БАНК" },
                           { "id" => "100000000018", "name" => "ОТП Банк" },
                           { "id" => "100000000212", "name" => "КБ Крокус-Банк" },
                           { "id" => "100000000024", "name" => "Хоум кредит" },
                           { "id" => "100000000032", "name" => "КБ Ренессанс Кредит" },
                           { "id" => "100000000225", "name" => "УКБ Белгородсоцбанк" },
                           { "id" => "100000000272", "name" => "Хайс Банк" },
                           { "id" => "100000000219", "name" => "Севергазбанк" },
                           { "id" => "100000000184", "name" => "АКБ НРБанк" },
                           { "id" => "100000000110", "name" => "КБ Москоммерцбанк" },
                           { "id" => "100000000180", "name" => "Кубаньторгбанк" },
                           { "id" => "100000000222", "name" => "УКБ Новобанк" },
                           { "id" => "100000000233", "name" => "НК Банк" },
                           { "id" => "100000000138", "name" => "Тойота Банк" },
                           { "id" => "100000000133", "name" => "ББР Банк" },
                           { "id" => "100000000245", "name" => "АКБ Ланта-Банк" },
                           { "id" => "100000000270", "name" => "КБ Долинск" },
                           { "id" => "100000000216", "name" => "Банк Финсервис" },
                           { "id" => "100000000042", "name" => "КБ ЮНИСТРИМ" },
                           { "id" => "100000000067", "name" => "КБ Новый век" },
                           { "id" => "100000000192", "name" => "Банк МБА-МОСКВА" },
                           { "id" => "100000000041", "name" => "БКС Банк" },
                           { "id" => "100000000200", "name" => "АКБ СЛАВИЯ" },
                           { "id" => "100000000167", "name" => "АКБ ЕВРОФИНАНС МОСНАРБАНК" },
                           { "id" => "100000000150", "name" => "Яндекс Банк" },
                           { "id" => "100000000260", "name" => "Банк БЖФ" },
                           { "id" => "100000000161", "name" => "КБ ЛОКО-Банк" },
                           { "id" => "100000000234", "name" => "БАНК МОСКВА-СИТИ" },
                           { "id" => "100000000250", "name" => "Драйв Клик Банк" },
                           { "id" => "100000000149", "name" => "ГУТА-БАНК" },
                           { "id" => "100000000278", "name" => "ФИНСТАР БАНК" },
                           { "id" => "100000000247", "name" => "банк Раунд" },
                           { "id" => "100000000228", "name" => "Прио-Внешторгбанк" },
                           { "id" => "100000000196", "name" => "Инбанк" },
                           { "id" => "100000000096", "name" => "Уралфинанс" },
                           { "id" => "100000000102", "name" => "Банк Агророс" },
                           { "id" => "100000000160", "name" => "ЮГ-Инвестбанк" },
                           { "id" => "100000000231", "name" => "ЦентроКредит" },
                           { "id" => "100000000163", "name" => "Снежинский" },
                           { "id" => "100000000040", "name" => "Банк ФИНАМ" },
                           { "id" => "100000000284", "name" => "Банк Точка" },
                           { "id" => "100000000266", "name" => "банк Элита" },
                           { "id" => "100000000046", "name" => "Металлинвестбанк" },
                           { "id" => "100000000117", "name" => "ПроБанк" },
                           { "id" => "100000000265", "name" => "Цифра банк" },
                           { "id" => "100000000273", "name" => "Озон Банк (Ozon)" },
                           { "id" => "100000000137", "name" => "Первый Дортрансбанк" },
                           { "id" => "100000000282", "name" => "ЦМРБанк" },
                           { "id" => "100000000296", "name" => "Плайт" },
                           { "id" => "100000000286", "name" => "Банк Оранжевый" },
                           { "id" => "100000000004", "name" => "Тинькофф Банк" }],
        "result" => { "message" => "Request completed successfully", "status" => true }
      }
    end

    context "when transaction is valid", vcr: "bank/all" do
      it "returns all SBP banks" do
        expect(result).to eq(banks_data)
      end
    end
  end

  describe "#by_phone" do
    subject(:result) { bank.by_phone(phone) }

    let(:phone) { "89221111111" }

    let(:bank_data) do
      {
        "errors" => nil,
        "header" => { "androidVersion" => 1, "iosVersion" => "1.0", "lang" => "EN", "traceId" => "ed69f7803b953c40",
                      "txName" => "", "version" => "0.1" },
        "responseData" => [],
        "result" => { "message" => "Request completed successfully", "status" => true }
      }
    end

    context "when transaction is valid", vcr: "bank/by_phone" do
      it "returns SBP banks by phone" do
        expect(result).to eq(bank_data)
      end
    end
  end
end
